Revit 2025 API
ExternalDataInstanceAddedIntoDocumentEventArgs.NewInstanceId Property
 The newly added external data instance id.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public ElementId NewInstanceId { get; }
Public ReadOnly Property NewInstanceId As ElementId
	Get
public:
property ElementId^ NewInstanceId {
	ElementId^ get ();
}
member NewInstanceId : ElementId with get
Property Value
ElementId
See Also
Reference
ExternalDataInstanceAddedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace